[
    {
      "myth": "Feminism is about hating men",
      "debunk": "Feminism is about advocating for gender equality. It aims to address and challenge systemic inequalities faced by women, but it does not mean hating men. Many feminists, including men, work towards a more just and equal society for all genders."
    },
    {
      "myth": "Feminists believe women are superior to men",
      "debunk": "Feminism seeks equality, not female superiority. The movement addresses the various ways in which women have been disadvantaged and aims to create equal opportunities for all, regardless of gender."
    },
    {
      "myth": "Feminism is no longer needed",
      "debunk": "While significant progress has been made, gender inequality still exists in many forms around the world. Issues such as the gender pay gap, underrepresentation in leadership positions, and gender-based violence highlight the continued need for feminism."
    },
    {
      "myth": "Only women can be feminists",
      "debunk": "Feminism is for everyone who believes in gender equality. Men can and do play an important role in supporting feminist causes and advocating for equal rights."
    },
    {
      "myth": "Feminists are anti-family",
      "debunk": "Feminists advocate for the right of all individuals to make choices about their lives, including family life. This includes the right to work, to be a stay-at-home parent, or to balance both, without societal judgment or discrimination."
    },
    {
      "myth": "Feminists are all angry and aggressive",
      "debunk": "Like any social movement, feminism encompasses a wide range of people with diverse approaches and attitudes. While some feminists may express frustration over ongoing inequalities, many others engage in peaceful and constructive advocacy."
    },
    {
      "myth": "Feminism is only about women's issues",
      "debunk": "Feminism addresses a wide range of issues that affect all genders, including toxic masculinity, mental health, and parental leave. It aims to dismantle harmful gender norms and create a fairer society for everyone."
    },
    {
      "myth": "Feminists want to destroy traditional gender roles",
      "debunk": "Feminism promotes the idea that people should have the freedom to choose their own paths without being confined by traditional gender roles. It supports the right to pursue roles traditionally associated with the other gender, but it does not seek to eliminate those roles entirely."
    },
    {
      "myth": "All feminists are liberals or left-wing",
      "debunk": "Feminism is a diverse movement that includes people from various political ideologies. There are conservative feminists, socialist feminists, and many others who support gender equality from different political perspectives."
    },
    {
      "myth": "Feminism only benefits women",
      "debunk": "Feminism benefits everyone by challenging and dismantling restrictive gender norms. This leads to a more just society where individuals can thrive regardless of their gender. Men also benefit from feminism, as it addresses issues such as paternity leave, mental health, and the pressure to conform to traditional masculinity."
    }
  ]
  